Generator(
  (stem): Sequential(
    (0): Linear(in_features=80, out_features=512, bias=True)
    (1): SiLU(inplace=True)
    (2): Linear(in_features=512, out_features=3744, bias=True)
    (3): SiLU(inplace=True)
  )
  (layers): ModuleList(
    (0): NeRVBlock(
      (conv): CustomConv(
        (conv): Conv2d(26, 650, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
        (up_scale): PixelShuffle(upscale_factor=5)
      )
      (norm): Identity()
      (act): SiLU(inplace=True)
    )
    (1): NeRVBlock(
      (conv): CustomConv(
        (conv): Conv2d(26, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
        (up_scale): PixelShuffle(upscale_factor=2)
      )
      (norm): Identity()
      (act): SiLU(inplace=True)
    )
    (2-4): 3 x NeRVBlock(
      (conv): CustomConv(
        (conv): Conv2d(96, 384, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
        (up_scale): PixelShuffle(upscale_factor=2)
      )
      (norm): Identity()
      (act): SiLU(inplace=True)
    )
  )
  (head_layers): ModuleList(
    (0-3): 4 x None
    (4): Conv2d(96, 3, kernel_size=(1, 1), stride=(1, 1))
  )
)
Params: 3.201905M
Rank:None, Step [1/250], PSNR: 8.2, MSSSIM: 0.248 FPS: 0.32
Rank:None, Step [51/250], PSNR: 8.03, MSSSIM: 0.1358 FPS: 9.42
Rank:None, Step [101/250], PSNR: 8.14, MSSSIM: 0.1699 FPS: 13.19
Rank:None, Step [151/250], PSNR: 8.21, MSSSIM: 0.1975 FPS: 15.16
Rank:None, Step [201/250], PSNR: 8.22, MSSSIM: 0.2049 FPS: 16.45
